In [1]:
import numpy as np

import pandas as pd

from pandas import Series , DataFrame 

sr = Series()
df = DataFrame()

C:\Users\manas\AppData\Local\Temp\ipykernel_2444\3437666776.py:7: FutureWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  sr = Series()

# SERIES IN PANDAS

In [2]:
ob = pd.Series([4,76,99,898])
ob

0      4
1     76
2     99
3    898
dtype: int64

#### custom index

In [3]:
ob2 = pd.Series([1,2,4,5,5,6,4,98,3,],index=['z','y','x','w','u','t',9,'asss','chal '])
print(ob2,'\n\n')

print(ob2[9],'\n')

print(ob2['asss'],'\n')

print(ob2[['z','w','t',9]])

z         1
y         2
x         4
w         5
u         5
t         6
9         4
asss     98
chal      3
dtype: int64


4

98

z    1
w    5
t    6
9    4
dtype: int64

In [4]:
print(ob2 *2)

print(ob2)

z          2
y          4
x          8
w         10
u         10
t         12
9          8
asss     196
chal       6
dtype: int64
z         1
y         2
x         4
w         5
u         5
t         6
9         4
asss     98
chal      3
dtype: int64

In [5]:

print('z' in ob2.index)

print('z' in  ob2)

print(98 in ob2)

print(98 in ob2.array)

True
True
False
True

## Using dictionary to create pandas Series

In [6]:
dict1 = {'Penthouse apartment':1,'Chartered Plane':2,'Hypercar':3,'Yacht':4}

ob3 = pd.Series(dict1)

print(ob3)

print(ob3.to_dict())

Penthouse apartment    1
Chartered Plane        2
Hypercar               3
Yacht                  4
dtype: int64
{'Penthouse apartment': 1, 'Chartered Plane': 2, 'Hypercar': 3, 'Yacht': 4}

#### overriding dict keys

In [7]:
real = ['Chartered Plane','Family','Hypercar','Yacht']
ob4 = pd.Series(dict1,index=real)

ob4

Chartered Plane    2.0
Family             NaN
Hypercar           3.0
Yacht              4.0
dtype: float64

In [8]:
print(pd.isna(ob4)) ## alternate ob4.isna()

print(pd.notna(ob4))  ## alternate ob4.notna()

Chartered Plane    False
Family              True
Hypercar           False
Yacht              False
dtype: bool
Chartered Plane     True
Family             False
Hypercar            True
Yacht               True
dtype: bool

### Arithmentic operations netween series

#### It works like the join in SQL and the output is given out in alphabetically or numerically ascending order depending on the index only, the values are not even considered

In [9]:
print(ob3)

Penthouse apartment    1
Chartered Plane        2
Hypercar               3
Yacht                  4
dtype: int64

In [10]:
print(ob4)

Chartered Plane    2.0
Family             NaN
Hypercar           3.0
Yacht              4.0
dtype: float64

In [11]:
 print(ob3 + ob4)

Chartered Plane        4.0
Family                 NaN
Hypercar               6.0
Penthouse apartment    NaN
Yacht                  8.0
dtype: float64

In [12]:
print(ob3 * ob4)

Chartered Plane         4.0
Family                  NaN
Hypercar                9.0
Penthouse apartment     NaN
Yacht                  16.0
dtype: float64

In [13]:
ob5 = pd.Series([100,200,300,400,500])
ob5.name = 'Hundreds'
ob5.index.name='Index'
print(ob5,'\n')

ob5.index = ['Shunya','Ek','Do','Teen','Chaar']
ob5.index.name='Index'
ob5

Index
0    100
1    200
2    300
3    400
4    500
Name: Hundreds, dtype: int64

Index
Shunya    100
Ek        200
Do        300
Teen      400
Chaar     500
Name: Hundreds, dtype: int64

In [14]:
listr = np.arange(0,11,1)
print(listr)

[ 0  1  2  3  4  5  6  7  8  9 10]

In [15]:
# tmp = pd.Series(listr,index = ('set'))   ## just trying something with Series's index
# tmp

# DATAFRAMES IN PANDAS

In [16]:
data = {'state Name':['Maharashtra','Bihar','Punjab','Kerala','Andhra Pradesh'],'year':[2000,2001,2002,2003,2004],'popn':[100,2000,1000,500,499]}


df = pd.DataFrame(data)

print(df)

pd.DataFrame(data,columns = ['year','popn','state Name'])

       state Name  year  popn
0     Maharashtra  2000   100
1           Bihar  2001  2000
2          Punjab  2002  1000
3          Kerala  2003   500
4  Andhra Pradesh  2004   499

   year  popn      state Name
0  2000   100     Maharashtra
1  2001  2000           Bihar
2  2002  1000          Punjab
3  2003   500          Kerala
4  2004   499  Andhra Pradesh

### now we will see a little regarding column name calling

In [17]:
frame2 = pd.DataFrame(data,columns = ['year','popn','state Name','debt'])

frame2

   year  popn      state Name debt
0  2000   100     Maharashtra  NaN
1  2001  2000           Bihar  NaN
2  2002  1000          Punjab  NaN
3  2003   500          Kerala  NaN
4  2004   499  Andhra Pradesh  NaN

In [18]:
frame2.popn  ## dot col calling can be used only if the column name is a single word

0     100
1    2000
2    1000
3     500
4     499
Name: popn, dtype: int64

In [19]:
frame2['state Name'] ## this is the way to call a col if it is of more than one word

0       Maharashtra
1             Bihar
2            Punjab
3            Kerala
4    Andhra Pradesh
Name: state Name, dtype: object

## calling the rows

In [20]:
print(frame2,'\n\n')

print(frame2.loc[3],'\n')

print(frame2.iloc[1])

   year  popn      state Name debt
0  2000   100     Maharashtra  NaN
1  2001  2000           Bihar  NaN
2  2002  1000          Punjab  NaN
3  2003   500          Kerala  NaN
4  2004   499  Andhra Pradesh  NaN


year            2003
popn             500
state Name    Kerala
debt             NaN
Name: 3, dtype: object

year           2001
popn           2000
state Name    Bihar
debt            NaN
Name: 1, dtype: object

In [21]:
frame2['debt'] = 9

frame2

   year  popn      state Name  debt
0  2000   100     Maharashtra     9
1  2001  2000           Bihar     9
2  2002  1000          Punjab     9
3  2003   500          Kerala     9
4  2004   499  Andhra Pradesh     9

In [22]:
frame2['debt'] = np.arange(5.)

frame2

   year  popn      state Name  debt
0  2000   100     Maharashtra   0.0
1  2001  2000           Bihar   1.0
2  2002  1000          Punjab   2.0
3  2003   500          Kerala   3.0
4  2004   499  Andhra Pradesh   4.0

In [23]:


vall = pd.Series(np.arange(35,40,1),index = ['ek','do','teen','chaar','paanch'])

frame2['debt'] = vall

print(vall)

frame2

ek        35
do        36
teen      37
chaar     38
paanch    39
dtype: int32

   year  popn      state Name  debt
0  2000   100     Maharashtra   NaN
1  2001  2000           Bihar   NaN
2  2002  1000          Punjab   NaN
3  2003   500          Kerala   NaN
4  2004   499  Andhra Pradesh   NaN

In [24]:


vall1 = pd.Series(np.arange(35,40,1),index = [0,1,2,887,4])

frame2['debt'] = vall1

print(vall1)

frame2

0      35
1      36
2      37
887    38
4      39
dtype: int32

   year  popn      state Name  debt
0  2000   100     Maharashtra  35.0
1  2001  2000           Bihar  36.0
2  2002  1000          Punjab  37.0
3  2003   500          Kerala   NaN
4  2004   499  Andhra Pradesh  39.0

### Adding new Columns

In [25]:
frame2['northern'] = frame2['state Name']=='Bihar' 

frame2

   year  popn      state Name  debt  northern
0  2000   100     Maharashtra  35.0     False
1  2001  2000           Bihar  36.0      True
2  2002  1000          Punjab  37.0     False
3  2003   500          Kerala   NaN     False
4  2004   499  Andhra Pradesh  39.0     False

In [26]:
del frame2["northern"]

frame2

   year  popn      state Name  debt
0  2000   100     Maharashtra  35.0
1  2001  2000           Bihar  36.0
2  2002  1000          Punjab  37.0
3  2003   500          Kerala   NaN
4  2004   499  Andhra Pradesh  39.0

In [27]:
frame2.columns

frame2.index

RangeIndex(start=0, stop=5, step=1)

In [28]:
k =frame2["year"][:-4]

print(k)

m = frame2["popn"][:2]
m

0    2000
Name: year, dtype: int64

0     100
1    2000
Name: popn, dtype: int64

## Passing nested dictionary into DataFrames

In [29]:
population={"Maharashtra":{2000:3.5,2001:4.5,2002:7.5},"Bihar":{2002:6,2003:12,2004:36}}

frame3 = pd.DataFrame(population)

frame3

      Maharashtra  Bihar
2000          3.5    NaN
2001          4.5    NaN
2002          7.5    6.0
2003          NaN   12.0
2004          NaN   36.0

#### Transposing a DataFrame

In [30]:
frame3.T

             2000  2001  2002  2003  2004
Maharashtra   3.5   4.5   7.5   NaN   NaN
Bihar         NaN   NaN   6.0  12.0  36.0

In [31]:
newpop = {"Maharashtra":frame3["Maharashtra"][:-1],
             "Bihar":frame3["Bihar"][:4]            }


print(newpop)

print(type(newpop))

{'Maharashtra': 2000    3.5
2001    4.5
2002    7.5
2003    NaN
Name: Maharashtra, dtype: float64, 'Bihar': 2000     NaN
2001     NaN
2002     6.0
2003    12.0
Name: Bihar, dtype: float64}
<class 'dict'>

In [32]:
pd.DataFrame(newpop)

      Maharashtra  Bihar
2000          3.5    NaN
2001          4.5    NaN
2002          7.5    6.0
2003          NaN   12.0

In [33]:
frame3.name="State"
frame3

      Maharashtra  Bihar
2000          3.5    NaN
2001          4.5    NaN
2002          7.5    6.0
2003          NaN   12.0
2004          NaN   36.0

In [34]:
frame3.index.name = "Years"

frame3.columns.name = "States"

frame3

States  Maharashtra  Bihar
Years
2000            3.5    NaN
2001            4.5    NaN
2002            7.5    6.0
2003            NaN   12.0
2004            NaN   36.0

In [35]:
frame2.to_numpy()

array([[2000, 100, 'Maharashtra', 35.0],
       [2001, 2000, 'Bihar', 36.0],
       [2002, 1000, 'Punjab', 37.0],
       [2003, 500, 'Kerala', nan],
       [2004, 499, 'Andhra Pradesh', 39.0]], dtype=object)

In [36]:
frame2

   year  popn      state Name  debt
0  2000   100     Maharashtra  35.0
1  2001  2000           Bihar  36.0
2  2002  1000          Punjab  37.0
3  2003   500          Kerala   NaN
4  2004   499  Andhra Pradesh  39.0

In [37]:
frame_4 = pd.DataFrame(data,index = [1,1,1,1,1])       ## Just seeing if index can be duplicates
                               
print(frame_4)

print(frame_4[:1])

       state Name  year  popn
1     Maharashtra  2000   100
1           Bihar  2001  2000
1          Punjab  2002  1000
1          Kerala  2003   500
1  Andhra Pradesh  2004   499
    state Name  year  popn
1  Maharashtra  2000   100

In [38]:
print(frame3)

frame3.iloc[1]

States  Maharashtra  Bihar
Years
2000            3.5    NaN
2001            4.5    NaN
2002            7.5    6.0
2003            NaN   12.0
2004            NaN   36.0

States
Maharashtra    4.5
Bihar          NaN
Name: 2001, dtype: float64

In [39]:
2001 in frame3.index

True

In [40]:
3.5 in frame3.columns

False

In [41]:
"Bihar"  in frame3.columns

True

In [42]:
2000 in frame3

False

### If you don't give column names, DataFrame takes integer column names by default

In [43]:
employees = [['Stuti', 28, 'Varanasi', 20000],
            ['Saumya', 32, 'Delhi', 25000],
            ['Aaditya', 25, 'Mumbai', 40000],
            ['Saumya', 32, 'Delhi', 35000],
            ['Saumya', 32, 'Delhi', 30000],
            ]

emp = pd.DataFrame(employees)

emp

         0   1         2      3
0    Stuti  28  Varanasi  20000
1   Saumya  32     Delhi  25000
2  Aaditya  25    Mumbai  40000
3   Saumya  32     Delhi  35000
4   Saumya  32     Delhi  30000

In [44]:
frame_4.loc[1]

       state Name  year  popn
1     Maharashtra  2000   100
1           Bihar  2001  2000
1          Punjab  2002  1000
1          Kerala  2003   500
1  Andhra Pradesh  2004   499

# 5.2 Essential Functionality

## Reindexing

In [45]:
obj = pd.Series([4,5,-5.5,3.6,7.2,9.0887],index = ['e','f','a','z','b','c'])

obj

e    4.0000
f    5.0000
a   -5.5000
z    3.6000
b    7.2000
c    9.0887
dtype: float64

In [46]:
print(obj.reindex(['a','b','c','d','e','f']),' reindex ke saath \n\n')

print(obj,', reindexing is not changing the original series')

a   -5.5000
b    7.2000
c    9.0887
d       NaN
e    4.0000
f    5.0000
dtype: float64  reindex ke saath


e    4.0000
f    5.0000
a   -5.5000
z    3.6000
b    7.2000
c    9.0887
dtype: float64 , reindexing is not changing the original series

## ffill AND reindex

In [47]:
obj3 = pd.Series(['blue','yellow','purple'],index = [0,2,4])
obj3

0      blue
2    yellow
4    purple
dtype: object

In [48]:
print(obj3,'\n')
print(obj3.reindex(np.arange(7),method = 'ffill'),'\n\n')
print(obj3.reindex(np.arange(7),method = 'bfill'),'\n\n')

0      blue
2    yellow
4    purple
dtype: object

0      blue
1      blue
2    yellow
3    yellow
4    purple
5    purple
6    purple
dtype: object


0      blue
1    yellow
2    yellow
3    purple
4    purple
5       NaN
6       NaN
dtype: object

In [49]:
frame = pd.DataFrame(np.arange(9).reshape(3,3),index = ['a','b','g'],
                    columns = ['maha','biha','punja']
                    )

frame

   maha  biha  punja
a     0     1      2
b     3     4      5
g     6     7      8

In [50]:
fame2 = frame.reindex(index = ['a','b','c','d','e','g'])
fame2

   maha  biha  punja
a   0.0   1.0    2.0
b   3.0   4.0    5.0
c   NaN   NaN    NaN
d   NaN   NaN    NaN
e   NaN   NaN    NaN
g   6.0   7.0    8.0

In [51]:
statess = ['punja','Bihar','maha']

print(pd.DataFrame(fame2.reindex(columns = statess) ))  # way 1

fame2.reindex(statess , axis = 'columns') # way 2

   punja  Bihar  maha
a    2.0    NaN   0.0
b    5.0    NaN   3.0
c    NaN    NaN   NaN
d    NaN    NaN   NaN
e    NaN    NaN   NaN
g    8.0    NaN   6.0

   punja  Bihar  maha
a    2.0    NaN   0.0
b    5.0    NaN   3.0
c    NaN    NaN   NaN
d    NaN    NaN   NaN
e    NaN    NaN   NaN
g    8.0    NaN   6.0

In [52]:
fame2.loc[['a','c','d'],['punja','maha']]

   punja  maha
a    2.0   0.0
c    NaN   NaN
d    NaN   NaN

### Dropping Entries from axis

#### In Series and in DataFrame

In [53]:
bbj = pd.Series(np.arange(5.),index = ['a','b','c','d','e'] )
bbj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [54]:
newobj = bbj.drop(index = ['c'])
#nobj = bbj.drop(columns)  Column axis cannot be dropped using Series
print(newobj)
bbj # drop does not change the original Series

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [55]:
df = pd.DataFrame

In [56]:
data = pd.DataFrame(np.arange(16.).reshape(4,4),index = ['Maha','Biha','Punja','Delh'],
                   columns = ['ek','do','teen','chaar'])
print(data,'\n\n')

data1 = data.drop(index = ['Biha','Punja'])

data1

         ek    do  teen  chaar
Maha    0.0   1.0   2.0    3.0
Biha    4.0   5.0   6.0    7.0
Punja   8.0   9.0  10.0   11.0
Delh   12.0  13.0  14.0   15.0

        ek    do  teen  chaar
Maha   0.0   1.0   2.0    3.0
Delh  12.0  13.0  14.0   15.0

In [57]:
data2 = data.drop(columns = ['do','chaar'],index = ['Maha','Delh']) # you can drop index(rows) and columns together

print(data)

data2

         ek    do  teen  chaar
Maha    0.0   1.0   2.0    3.0
Biha    4.0   5.0   6.0    7.0
Punja   8.0   9.0  10.0   11.0
Delh   12.0  13.0  14.0   15.0

        ek  teen
Biha   4.0   6.0
Punja  8.0  10.0

### Indexing selection and filtering

In [58]:
obj1 = pd.Series([1,2,3,4],index = ['a','b','c','d'])

print(obj1[[0,1]],'\n\n') # in series you can get the value either by index or by directly specifying the column value
print(obj1[['a','b']],'\n\n')
obj1

a    1
b    2
dtype: int64


a    1
b    2
dtype: int64

a    1
b    2
c    3
d    4
dtype: int64

In [59]:
obj1.loc[['c','b','d']]

c    3
b    2
d    4
dtype: int64

In [60]:
obj2 = pd.Series(np.arange(1,4),index = ['a','b','c'])
obj_1 = pd.Series(np.arange(1,4),index =[2,0,1])

print(obj_1,'  obj1 hai \n')
print(obj2,' obhj2 hai')

2    1
0    2
1    3
dtype: int32   obj1 hai

a    1
b    2
c    3
dtype: int32  obhj2 hai

In [61]:
print(obj_1)

obj_1[[2,1]] # it is taking it as an index, this means that if the 0th index is at 2nd or even 25th 
#position, it will provide the output from 0th index that is at 0th or 25th

2    1
0    2
1    3
dtype: int32

2    1
1    3
dtype: int32

In [62]:
print(obj2,'\n\n')
obj2[[1,2,0]] # here also it is taking as index, it MATTERS WHERE AND what the index label is.

a    1
b    2
c    3
dtype: int32

b    2
c    3
a    1
dtype: int32

In [63]:
obj2[['b','c','a']] # but as we can see here that it will also take series index value just as they are

## this means that the normal [] operator takes labels as index no matter if the index label
#is string or integer

b    2
c    3
a    1
dtype: int32

In [64]:
# THIS IS AN IMPORTANT BLOCK, READ CAREFULLY.
# suppose in a series, the index labels are integers, then the value that you enter in [] matters,
# suppose the 0th index is at 345th position, hence if you enter obj22[0], it will show the value of
# 345th position. Now, if the index labels are strings, then if you enter say obj22['e'], it will
# show the value that is corresponding to eth index, but if you enter obj22[5], then it will show the 
# value corresponding to the 5th position, hence , [] parameter works differently for int and str

obj22 = pd.Series(np.arange(6.),index = ['z','v','a','e','b','h'])
print(obj22,'\n\n')

print(obj22[[0,1,2]],' int index \n\n')

print(obj22[['e']],'\n\n')

print(obj22[[5]])

z    0.0
v    1.0
a    2.0
e    3.0
b    4.0
h    5.0
dtype: float64


z    0.0
v    1.0
a    2.0
dtype: float64  int index


e    3.0
dtype: float64


h    5.0
dtype: float64

In [65]:
# now the part with loc, you need to enter the value exactly as it is in the index, ex:- if the index 
# label is string, loc will run only if string index is entered, similarly for integers as well.

print(obj_1,'\n\n')

obj_1.loc[[0,1]] # here, one thing to note is that in loc though we have given input ass [0,1], it is
# showing the value of 1st and 2nd row

2    1
0    2
1    3
dtype: int32

0    2
1    3
dtype: int32

In [216]:
obj_1

2    1
0    2
1    3
dtype: int32

In [67]:
print(obj2,'\n\n')

obj2.loc[['b','a']] # this will run

# obj2.loc[[1,2]] this will fail

a    1
b    2
c    3
dtype: int32

b    2
a    1
dtype: int32

### Now the iloc part

In [68]:
# iloc is made so that irrespective ofthe label type, iloc will work it as an integer only
print(obj2,'\n\n')

obj2.iloc[[1,2,0]]

a    1
b    2
c    3
dtype: int32

b    2
c    3
a    1
dtype: int32

In [69]:
print(obj_1,' obj_1 hai\n\n')


print(obj_1[[0,1]],'\n\n') # we have selected 0,1 but is actually showing elements of 1st and 2nd position

print(obj_1.loc[2:0],' dusra') # here also, slicing is starting from 2nd position as if it 
# is the first index

obj2.loc['a':'c']

2    1
0    2
1    3
dtype: int32  obj_1 hai


0    2
1    3
dtype: int32


2    1
0    2
dtype: int32  dusra

a    1
b    2
c    3
dtype: int32

In [70]:
## MAJOR DIFFERENCE BETWEEN LOC AND ILOC
## iloc[0,1,2] will print the first,second and the third row vale irrespective of where the 0th,
## 1st or 2nd index is

## whereas loc[0,1,2] will show the row value of 0th,1st and 2nd position where they are, example 
## if the index format is [37,2,456,0,455,1]
## loc[0,1,2] will show the value of 3rd, last and 1st position

print(obj_1,'\n\n')

print(obj_1.loc[[0,1]],'loc ke saath \n\n')

print(obj_1.iloc[[0,1]],'iloc ke saath \n\n')

2    1
0    2
1    3
dtype: int32


0    2
1    3
dtype: int32 loc ke saath


2    1
0    2
dtype: int32 iloc ke saath

In [71]:
obj2[['b']]

b    2
dtype: int32

In [72]:
data = pd.DataFrame(np.arange(16).reshape(4,4),
                   index = ['maha','bihar','kerala','punjab'],
                    columns = ['ek','do','teen','chaar']
                    
                   )

data

        ek  do  teen  chaar
maha     0   1     2      3
bihar    4   5     6      7
kerala   8   9    10     11
punjab  12  13    14     15

In [73]:
data['do']

maha       1
bihar      5
kerala     9
punjab    13
Name: do, dtype: int32

In [74]:
print(data)

data[['teen','chaar']]

        ek  do  teen  chaar
maha     0   1     2      3
bihar    4   5     6      7
kerala   8   9    10     11
punjab  12  13    14     15

        teen  chaar
maha       2      3
bihar      6      7
kerala    10     11
punjab    14     15

In [75]:
data.loc[['maha','bihar'],['ek','do']]

       ek  do
maha    0   1
bihar   4   5

In [76]:
#data.iloc[['maha','bihar'],['ek','do']]

data.iloc[[0,1],[0,1]]

       ek  do
maha    0   1
bihar   4   5

In [77]:
data

        ek  do  teen  chaar
maha     0   1     2      3
bihar    4   5     6      7
kerala   8   9    10     11
punjab  12  13    14     15

In [78]:
data[data['teen']>5] # it is giving all the columns, even the ones that have value less than 5

        ek  do  teen  chaar
bihar    4   5     6      7
kerala   8   9    10     11
punjab  12  13    14     15

In [79]:
print(data[data<5])

data

         ek   do  teen  chaar
maha    0.0  1.0   2.0    3.0
bihar   4.0  NaN   NaN    NaN
kerala  NaN  NaN   NaN    NaN
punjab  NaN  NaN   NaN    NaN

        ek  do  teen  chaar
maha     0   1     2      3
bihar    4   5     6      7
kerala   8   9    10     11
punjab  12  13    14     15

## ROW AND COLUMN INDEXING WITH LOC

In [80]:
data

        ek  do  teen  chaar
maha     0   1     2      3
bihar    4   5     6      7
kerala   8   9    10     11
punjab  12  13    14     15

In [81]:
data.loc[:,['do']] # just a col

        do
maha     1
bihar    5
kerala   9
punjab  13

In [82]:
data.loc[['bihar']] # just a row

       ek  do  teen  chaar
bihar   4   5     6      7

In [83]:
data.loc[['bihar','kerala']] # two rows

        ek  do  teen  chaar
bihar    4   5     6      7
kerala   8   9    10     11

In [84]:
data.loc[['maha'],['do']] # row and col

      do
maha   1

In [85]:
data.loc[['maha','kerala'],['do']] # two rows and one col

        do
maha     1
kerala   9

In [86]:
data.loc[['maha'],['do','teen']] # one row two cols

      do  teen
maha   1     2

In [87]:
data.loc[['maha','kerala'],['do','teen']] # two rows and two cols

        do  teen
maha     1     2
kerala   9    10

## ROW AND COLUMN INDEXING WITH ILOC

In [88]:
data

        ek  do  teen  chaar
maha     0   1     2      3
bihar    4   5     6      7
kerala   8   9    10     11
punjab  12  13    14     15

In [89]:
data.iloc[:,[2]] # just a col

        teen
maha       2
bihar      6
kerala    10
punjab    14

In [90]:
data.iloc[[2]] # just a row

        ek  do  teen  chaar
kerala   8   9    10     11

In [91]:
data.iloc[[2,3]] # two rows

        ek  do  teen  chaar
kerala   8   9    10     11
punjab  12  13    14     15

In [92]:
data.iloc[[0],[1]] # row and col

      do
maha   1

In [93]:
data.iloc[[2],[1,3]]  # one row two cols

        do  chaar
kerala   9     11

In [94]:
data.iloc[[2,3],[2]] # two rows and one col

        teen
kerala    10
punjab    14

In [95]:
data.iloc[[0,1],[1,2]] # two rows and two cols

       do  teen
maha    1     2
bihar   5     6

# PANDAS MEI "SLICING" KARTE TIME, LOC HO YAA ILOC


# SINGLE LIST JAAYEGA EX data.loc[:2,:3], BUT AGAR 

# COLUMNS SELECT KARNA HAI TOH DOUBLE EX:

# data.loc[['kerala','maha'],['ek','do']]

# AND AGAR DONO KA COMBO CHAHIYE TOH AOSE KARNE KA

# data.loc[:'kerala',['ek,'do']]

### IN SLICING USING LOC, THE END POINT IS INCLUDED

In [96]:
data.loc[:'kerala',['teen','chaar']]

        teen  chaar
maha       2      3
bihar      6      7
kerala    10     11

### IN SLICING USING ILOC, END POINT IS NOT INCLUDED

In [97]:
data.iloc[:,:3]

        ek  do  teen
maha     0   1     2
bihar    4   5     6
kerala   8   9    10
punjab  12  13    14

In [98]:
dd = pd.DataFrame(np.arange(9).reshape(3,3),
                 index = [0,1,2],
                 columns = ['a','b','c'])
dd

   a  b  c
0  0  1  2
1  3  4  5
2  6  7  8

In [99]:
dd.loc[:2,:'c']

   a  b  c
0  0  1  2
1  3  4  5
2  6  7  8

In [100]:
dd.iloc[:2,:2]

   a  b
0  0  1
1  3  4

In [101]:
data[data["teen"]>5]

        ek  do  teen  chaar
bihar    4   5     6      7
kerala   8   9    10     11
punjab  12  13    14     15

In [102]:
data[data["teen"]<5] = 0

In [103]:
data[data<5] = 0
data

        ek  do  teen  chaar
maha     0   0     0      0
bihar    0   5     6      7
kerala   8   9    10     11
punjab  12  13    14     15

#### just trying so,ething in indexing

In [104]:
print(data.iloc[:,:3],'\n\n')


data.iloc[:,:3][data['teen']>5] # although you can see that a value less tha 5 has been printed, it's
# like that only nothing you can do

        ek  do  teen
maha     0   0     0
bihar    0   5     6
kerala   8   9    10
punjab  12  13    14

        ek  do  teen
bihar    0   5     6
kerala   8   9    10
punjab  12  13    14

###  Boolean arrays can be used with loc but not with iloc

In [105]:
data[data['teen']>2]

        ek  do  teen  chaar
bihar    0   5     6      7
kerala   8   9    10     11
punjab  12  13    14     15

In [106]:
data['teen']>2

maha      False
bihar      True
kerala     True
punjab     True
Name: teen, dtype: bool

In [107]:
data.loc[data['teen']>2]

        ek  do  teen  chaar
bihar    0   5     6      7
kerala   8   9    10     11
punjab  12  13    14     15

In [108]:
#data.iloc[data['teen']>2]  this does not wok as iloc does not accept boolean value

### Integer values and index isues

In [5]:
dd = pd.Series(np.arange(2,5))
dd

0    2
1    3
2    4
dtype: int32

####  Here see what happens carefully

In [8]:
#dd[3]

###  The above code throws an error because since both the index and the values are integers, pandas does not know whether you refereing to the value or the index

In [111]:
## Now, see this code

In [112]:
de = pd.Series(np.arange(7,10),index = ['a','b','c'])
de

a    7
b    8
c    9
dtype: int32

In [113]:
de[1]

8

### Here, in the above code, there is no ambiguity as index labels are non integers

In [114]:
data

        ek  do  teen  chaar
maha     0   0     0      0
bihar    0   5     6      7
kerala   8   9    10     11
punjab  12  13    14     15

In [115]:
data.iloc[:,:3]

        ek  do  teen
maha     0   0     0
bihar    0   5     6
kerala   8   9    10
punjab  12  13    14

In [116]:
data.loc[:'kerala',['do','ek']]

        do  ek
maha     0   0
bihar    5   0
kerala   9   8

In [117]:
print(data['chaar'] > 5,'\n\n')


data[data['chaar']>5]

maha      False
bihar      True
kerala     True
punjab     True
Name: chaar, dtype: bool

        ek  do  teen  chaar
bihar    0   5     6      7
kerala   8   9    10     11
punjab  12  13    14     15

In [118]:
print(data)

data.loc[data['teen']==10,'teen']

        ek  do  teen  chaar
maha     0   0     0      0
bihar    0   5     6      7
kerala   8   9    10     11
punjab  12  13    14     15

kerala    10
Name: teen, dtype: int32

In [119]:
dicto1 = {'Penthouse apartment':1,'Chartered Plane':2,'Hypercar':3,'Yacht':4}

dicto1

{'Penthouse apartment': 1, 'Chartered Plane': 2, 'Hypercar': 3, 'Yacht': 4}

In [120]:
aap = pd.Series(dicto1)

aap

Penthouse apartment    1
Chartered Plane        2
Hypercar               3
Yacht                  4
dtype: int64

In [121]:
dicto2 = {'Penthouse apartment':['new york'],'Chartered Plane':['Los angeles'],'Hypercar':['dubai'],'Yacht':['Maldives']}


datasr = {'state Name':['Maharashtra','Bihar','Punjab','Kerala','Andhra Pradesh'],
          'year':[2000,2001,2002,2003,2004],'popn':[100,2000,1000,500,9008]}
paa = pd.DataFrame(dicto2)

paa

  Penthouse apartment Chartered Plane Hypercar     Yacht
0            new york     Los angeles    dubai  Maldives

## Artithmetic operation in DataFrame

In [122]:
# You already know how it's done in series right, to recap just refer the block

In [123]:
dict1 = {'Penthouse apartment':1,'Chartered Plane':2,'Hypercar':3,'Yacht':4}

ob3 = pd.Series(dict1)

print(ob3)

Penthouse apartment    1
Chartered Plane        2
Hypercar               3
Yacht                  4
dtype: int64

In [124]:
real = ['Chartered Plane','Family','Hypercar','Yacht']
ob4 = pd.Series(dict1,index=real)

ob4

Chartered Plane    2.0
Family             NaN
Hypercar           3.0
Yacht              4.0
dtype: float64

In [125]:
ob3 + ob4

Chartered Plane        4.0
Family                 NaN
Hypercar               6.0
Penthouse apartment    NaN
Yacht                  8.0
dtype: float64

In [126]:
df1 = pd.DataFrame(np.arange(9.).reshape(3,3),index = ['mumbai','chennai','Delhi'],columns= list('bcd'))

df1

           b    c    d
mumbai   0.0  1.0  2.0
chennai  3.0  4.0  5.0
Delhi    6.0  7.0  8.0

In [127]:
df2 = pd.DataFrame(np.arange(12.).reshape(4,3),index = ['Banglore','mumbai','chennai','sikkim'],
                   
                   columns = list('bde'))
df2

            b     d     e
Banglore  0.0   1.0   2.0
mumbai    3.0   4.0   5.0
chennai   6.0   7.0   8.0
sikkim    9.0  10.0  11.0

In [128]:
df1 + df2

            b   c     d   e
Banglore  NaN NaN   NaN NaN
Delhi     NaN NaN   NaN NaN
chennai   9.0 NaN  12.0 NaN
mumbai    3.0 NaN   6.0 NaN
sikkim    NaN NaN   NaN NaN

### Arithmetic methods with fill values

In [129]:
dff1 = pd.DataFrame(np.arange(12.).reshape(3,4),columns = list('abcd'))

dff1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [130]:
dff2 = pd.DataFrame(np.arange(20.).reshape(4,5),columns = list('abcde'))

dff2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [131]:
dff2.loc[1,'b'] = np.nan

dff2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [132]:
dff1 + dff2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [133]:
dff1.add(dff2,fill_value= 8838282)

           a          b          c          d          e
0        0.0        2.0        4.0        6.0  8838286.0
1        9.0  8838287.0       13.0       15.0  8838291.0
2       18.0       20.0       22.0       24.0  8838296.0
3  8838297.0  8838298.0  8838299.0  8838300.0  8838301.0

In [134]:
1/dff1

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [135]:
dff1/dff1

     a    b    c    d
0  NaN  1.0  1.0  1.0
1  1.0  1.0  1.0  1.0
2  1.0  1.0  1.0  1.0

In [136]:
print(dff1)

dff1.reindex(columns = dff2.columns, fill_value = 'filled')

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

     a    b     c     d       e
0  0.0  1.0   2.0   3.0  filled
1  4.0  5.0   6.0   7.0  filled
2  8.0  9.0  10.0  11.0  filled

### Arithmetic operations between DataFrame and Series

In [137]:
aaw = np.arange(12.).reshape(3,4)
aaw

array([[ 0.,  1.,  2.,  3.],
       [ 4.,  5.,  6.,  7.],
       [ 8.,  9., 10., 11.]])

In [138]:
aaw[0]

array([0., 1., 2., 3.])

In [139]:
aaw - aaw[0]

array([[0., 0., 0., 0.],
       [4., 4., 4., 4.],
       [8., 8., 8., 8.]])

In [140]:
frame = pd.DataFrame(np.arange(12.).reshape(4,3),
                    index = ['mumbai','agra','jammu','sikkim'],
                     columns = list('bde')
                    )

frame

          b     d     e
mumbai  0.0   1.0   2.0
agra    3.0   4.0   5.0
jammu   6.0   7.0   8.0
sikkim  9.0  10.0  11.0

In [141]:
sear = frame.iloc[1]

sear

b    3.0
d    4.0
e    5.0
Name: agra, dtype: float64

In [142]:
series2 = pd.Series(np.arange(3),index = list('bef'))

series2

b    0
e    1
f    2
dtype: int32

In [143]:
frame + series2

          b   d     e   f
mumbai  0.0 NaN   3.0 NaN
agra    3.0 NaN   6.0 NaN
jammu   6.0 NaN   9.0 NaN
sikkim  9.0 NaN  12.0 NaN

In [144]:
series3 = frame['d']

series3

mumbai     1.0
agra       4.0
jammu      7.0
sikkim    10.0
Name: d, dtype: float64

In [145]:
frame

          b     d     e
mumbai  0.0   1.0   2.0
agra    3.0   4.0   5.0
jammu   6.0   7.0   8.0
sikkim  9.0  10.0  11.0

In [146]:
series3

mumbai     1.0
agra       4.0
jammu      7.0
sikkim    10.0
Name: d, dtype: float64

In [147]:
frame.add(series3,axis = 'index')  # you can also write frame.add(series3,axis = 'rows')

           b     d     e
mumbai   1.0   2.0   3.0
agra     7.0   8.0   9.0
jammu   13.0  14.0  15.0
sikkim  19.0  20.0  21.0

In [148]:
frame.add(series3,axis = 'columns')

        agra   b   d   e  jammu  mumbai  sikkim
mumbai   NaN NaN NaN NaN    NaN     NaN     NaN
agra     NaN NaN NaN NaN    NaN     NaN     NaN
jammu    NaN NaN NaN NaN    NaN     NaN     NaN
sikkim   NaN NaN NaN NaN    NaN     NaN     NaN

In [149]:
frame + series3

        agra   b   d   e  jammu  mumbai  sikkim
mumbai   NaN NaN NaN NaN    NaN     NaN     NaN
agra     NaN NaN NaN NaN    NaN     NaN     NaN
jammu    NaN NaN NaN NaN    NaN     NaN     NaN
sikkim   NaN NaN NaN NaN    NaN     NaN     NaN

## Function application and mapping

### apply function

In [150]:
frame = pd.DataFrame(np.random.standard_normal((4,3)),
                     columns = list('bde'),
                     index = ['UP','MH','TN','KL'])


frame

           b         d         e
UP  0.410743 -0.820923 -0.674818
MH -1.363689  0.112190 -0.076930
TN  0.556813  0.174256 -0.502168
KL -0.606620  0.149422 -0.373295

In [151]:
np.abs(frame)

           b         d         e
UP  0.410743  0.820923  0.674818
MH  1.363689  0.112190  0.076930
TN  0.556813  0.174256  0.502168
KL  0.606620  0.149422  0.373295

In [152]:
## apply starts here, by default it is applied on column wise
## like as in the below example when the code was run, the lowest value for the b colums
## was the -2.102513 and highest was -0.109266, so it is being done col wise

In [153]:
def func1(x):
    return x.max() - x.min()

In [154]:
op = frame.apply(func1)

print(op,'\n\n')

frame

b    1.920502
d    0.995178
e    0.597888
dtype: float64

           b         d         e
UP  0.410743 -0.820923 -0.674818
MH -1.363689  0.112190 -0.076930
TN  0.556813  0.174256 -0.502168
KL -0.606620  0.149422 -0.373295

### To perform the apply function row wise follow below code

In [155]:
op = frame.apply(func1,axis='columns') # yes you read it right, we need to pass columns in the axis
#  argument for the apply function to apply the function row wise

print(op,'\n\n')

frame

UP    1.231666
MH    1.475879
TN    1.058981
KL    0.756042
dtype: float64

           b         d         e
UP  0.410743 -0.820923 -0.674818
MH -1.363689  0.112190 -0.076930
TN  0.556813  0.174256 -0.502168
KL -0.606620  0.149422 -0.373295

###  returning data in series

In [156]:
def fun2(x):
    return pd.Series([x.min(),x.max()],index = ['minimum','maximum'])

In [157]:
output=frame.apply(fun2)

print(output)

frame

                b         d         e
minimum -1.363689 -0.820923 -0.674818
maximum  0.556813  0.174256 -0.076930

           b         d         e
UP  0.410743 -0.820923 -0.674818
MH -1.363689  0.112190 -0.076930
TN  0.556813  0.174256 -0.502168
KL -0.606620  0.149422 -0.373295

## Sorting and Ranking

In [158]:
# In Series


obb = pd.Series(np.arange(5.),index = ['f','s','a','d','g'])

obb

f    0.0
s    1.0
a    2.0
d    3.0
g    4.0
dtype: float64

In [159]:
obb.sort_index()

a    2.0
d    3.0
f    0.0
g    4.0
s    1.0
dtype: float64

In [160]:
objj = pd.DataFrame(np.arange(8.).reshape((2,4)),
                   columns = ['d','a','v','s'],
                    index = ['teen','ek'])

objj

        d    a    v    s
teen  0.0  1.0  2.0  3.0
ek    4.0  5.0  6.0  7.0

In [161]:
objj.sort_index() # by default it will sort on rows

        d    a    v    s
ek    4.0  5.0  6.0  7.0
teen  0.0  1.0  2.0  3.0

In [162]:
objj.sort_index(axis = 'columns')

        a    d    s    v
teen  1.0  0.0  3.0  2.0
ek    5.0  4.0  7.0  6.0

In [163]:
objj.sort_index(axis = 'columns',ascending = False)

        v    s    d    a
teen  2.0  3.0  0.0  1.0
ek    6.0  7.0  4.0  5.0

In [164]:
obk = pd.Series([4,5,-2,7.5])
obk

0    4.0
1    5.0
2   -2.0
3    7.5
dtype: float64

In [165]:
obk.sort_values()

2   -2.0
0    4.0
1    5.0
3    7.5
dtype: float64

In [166]:
onn = pd.Series([4,np.nan,7,np.nan,-22,12])
onn

0     4.0
1     NaN
2     7.0
3     NaN
4   -22.0
5    12.0
dtype: float64

In [167]:
onn.sort_values()

4   -22.0
0     4.0
2     7.0
5    12.0
1     NaN
3     NaN
dtype: float64

In [168]:
onn.sort_values(na_position = 'first')

1     NaN
3     NaN
4   -22.0
0     4.0
2     7.0
5    12.0
dtype: float64

#### Sorting multiple columns in DataFrame

In [169]:
ovv = pd.DataFrame({'b':[22,-223,1,33,4],'a':[30,-35,12,95,55],'mm':[65,-98,12,34,9]})
ovv

     b   a  mm
0   22  30  65
1 -223 -35 -98
2    1  12  12
3   33  95  34
4    4  55   9

In [170]:
ovv.sort_values("b") # Dekh thoda scene ho raha hai, acc. to book agar tune sort_values() mei ho column
# pass kiya hai na, usually sirf vahi column sort hona chahiye, but abhi idhar baaki columns
# bhi sort ho rahe

     b   a  mm
1 -223 -35 -98
2    1  12  12
4    4  55   9
0   22  30  65
3   33  95  34

In [171]:
ovv.sort_values("a")

     b   a  mm
1 -223 -35 -98
2    1  12  12
0   22  30  65
4    4  55   9
3   33  95  34

In [172]:
ovv.sort_values(['mm','a','b'])

     b   a  mm
1 -223 -35 -98
4    4  55   9
2    1  12  12
3   33  95  34
0   22  30  65

In [173]:
# So basically what rank does is that it starts counting the index from 1, then it sorts the values in
# ascending order by default. then, it takes the average of the index

sos = pd.Series([56,56,4,4,4])
sos.rank()


# here when the sank is applied, the following happens
# 1st sos becomes =[4,4,4,56,56]
# 2nd, then rank for four is calculated which is 1+2+3/3 as the index starts from 1.
# same is done for 56
# then while returning the ouput, it is given in the form of the original series

0    4.5
1    4.5
2    2.0
3    2.0
4    2.0
dtype: float64

In [174]:
vv = pd.Series([1,2,3,4,5,6,7])
vv.rank()

0    1.0
1    2.0
2    3.0
3    4.0
4    5.0
5    6.0
6    7.0
dtype: float64

In [175]:
obbp = pd.Series([7,3,-5,7,4,0,2,4])
print(obbp.rank(),'\n\n')

print(obbp.sort_values())

obbp.rank(method = 'first')

0    7.5
1    4.0
2    1.0
3    7.5
4    5.5
5    2.0
6    3.0
7    5.5
dtype: float64


2   -5
5    0
6    2
1    3
4    4
7    4
0    7
3    7
dtype: int64

0    7.0
1    4.0
2    1.0
3    8.0
4    5.0
5    2.0
6    3.0
7    6.0
dtype: float64

In [176]:
framer = pd.DataFrame({'b':[4.3,7,-3,2],'a':[0,1,0,1],
                      'c':[-2,5,6,-2.5]})

framer

     b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  6.0
3  2.0  1 -2.5

In [177]:
framer.rank()

     b    a    c
0  3.0  1.5  2.0
1  4.0  3.5  3.0
2  1.0  1.5  4.0
3  2.0  3.5  1.0

In [178]:
framer.rank(axis= 'columns')

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

### Duplicates in axis

In [179]:
obj = pd.Series(np.arange(5.),index = ['a','b','c','a','c'])

obj

a    0.0
b    1.0
c    2.0
a    3.0
c    4.0
dtype: float64

In [180]:
obj['a']

a    0.0
a    3.0
dtype: float64

In [181]:
obj['b']

1.0

In [182]:
obj[1
   ]

1.0

In [183]:
ddf = pd.DataFrame(np.random.standard_normal((5,3)),
                  index = ['a','a','b','b','c'])

ddf

          0         1         2
a  0.436809 -1.709265  0.874692
a -2.238358 -0.772688 -0.253124
b  1.057883  0.686004  0.821487
b  0.522024 -1.603796  0.097933
c -0.417194 -1.433528 -0.959020

In [184]:
ddf[2]

a    0.874692
a   -0.253124
b    0.821487
b    0.097933
c   -0.959020
Name: 2, dtype: float64

In [185]:
ddf.loc['a']

          0         1         2
a  0.436809 -1.709265  0.874692
a -2.238358 -0.772688 -0.253124

In [186]:
ddf.iloc[[1]]

          0         1         2
a -2.238358 -0.772688 -0.253124

In [187]:
ddf = pd.DataFrame(np.random.standard_normal((5,5)),
                  index = ['a','a','b','b','c'],
                  columns = [1,1,22,2,3])

ddf

         1         1         22        2         3
a -1.569743 -1.387556  0.353366  1.392457  2.051148
a  0.191931  0.218789  0.109901  1.473365  1.357276
b  2.235117  0.027651 -0.486016  0.965232 -1.481505
b -0.543466  2.052882  0.429401  0.534681  0.092121
c -0.312567 -0.891114 -0.294417  0.420692 -2.817725

In [188]:
ddf[1]

          1         1
a -1.569743 -1.387556
a  0.191931  0.218789
b  2.235117  0.027651
b -0.543466  2.052882
c -0.312567 -0.891114

In [189]:
ddf.loc[:,1]

          1         1
a -1.569743 -1.387556
a  0.191931  0.218789
b  2.235117  0.027651
b -0.543466  2.052882
c -0.312567 -0.891114

In [190]:
ddf.loc[:,2]

a    1.392457
a    1.473365
b    0.965232
b    0.534681
c    0.420692
Name: 2, dtype: float64

##  Summarizing and computing Descriptive Statistics

In [191]:
dc = pd.DataFrame([[1.4,np.nan],[7.1,-4.5],
                  [np.nan,np.nan],[0.75,-1.333]
                  ],
                 index = ['a','b','c','d'],
                 
                 columns = ['one','two'])

dc

    one    two
a  1.40    NaN
b  7.10 -4.500
c   NaN    NaN
d  0.75 -1.333

In [192]:
dc.sum()

one    9.250
two   -5.833
dtype: float64

In [193]:
# By default, the nan values are omitted. But you can include them by using the following attribute

In [194]:
# IMPORTANT NOTE:- If you include nan value, then if the row or column contains even one nan value

# the entire sum will come up to be nan.

In [195]:

dc.sum(axis = 'columns') # Yes, you read it right. To sum across the columns, that basically means
# to get the row sum, you need to write columns in sum function

a    1.400
b    2.600
c    0.000
d   -0.583
dtype: float64

In [196]:
dc

    one    two
a  1.40    NaN
b  7.10 -4.500
c   NaN    NaN
d  0.75 -1.333

In [197]:
dc.sum(axis = 'index',skipna = False)

one   NaN
two   NaN
dtype: float64

In [198]:
df

pandas.core.frame.DataFrame

In [199]:
dc.sum(axis = 'columns',skipna = False)

a      NaN
b    2.600
c      NaN
d   -0.583
dtype: float64

In [200]:
dc.mean()

one    3.083333
two   -2.916500
dtype: float64

In [201]:
dc.mean(axis = 'columns')

a    1.4000
b    1.3000
c       NaN
d   -0.2915
dtype: float64

In [202]:
dc.idxmax()

one    b
two    d
dtype: object

In [203]:
dc.idxmin()

one    d
two    b
dtype: object

In [204]:

dc.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.916500
std    3.493685  2.239407
min    0.750000 -4.500000
25%    1.075000 -3.708250
50%    1.400000 -2.916500
75%    4.250000 -2.124750
max    7.100000 -1.333000

### On non-numeric data describe shows alternate statistics

In [205]:
onb = pd.Series(['ffg','gff','s','a','s','s','a'])

onb.describe()

count     7
unique    4
top       s
freq      3
dtype: object

### Unique values, value counts

In [206]:
onb = pd.Series(['c','a','d','a','a','b','b','c','c'])
onb

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [207]:
onb.unique()

array(['c', 'a', 'd', 'b'], dtype=object)

In [208]:
onb.value_counts()

c    3
a    3
b    2
d    1
dtype: int64

In [209]:
onb.value_counts().sort_index()

a    3
b    2
c    3
d    1
dtype: int64

In [210]:
dcc = pd.DataFrame({'Q1':[1,3,4,3,4],'Q2':[2,3,1,2,3],'Q3':[1,5,2,4,4]})
dcc

   Q1  Q2  Q3
0   1   2   1
1   3   3   5
2   4   1   2
3   3   2   4
4   4   3   4

In [211]:
dcc['Q1'].unique()

array([1, 3, 4], dtype=int64)

#### You can apply value_counts methos to one column only, to apply it to entire DataFrame, do as below

In [212]:
dcc.value_counts() # this works but looks bad

Q1  Q2  Q3
1   2   1     1
3   2   4     1
    3   5     1
4   1   2     1
    3   4     1
dtype: int64

In [213]:
dcc['Q1'].value_counts()

3    2
4    2
1    1
Name: Q1, dtype: int64

In [214]:
res = dcc.apply(pd.value_counts).fillna(0)

In [215]:
res

    Q1   Q2   Q3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0